# List of Contents
### 01. Importing Libraries
### 02. Importing Dataframes
### 03. Check Dimensions of Dataframes
### 04. Merge df_prods with orders_combined
### 05. Export Merged Dataframe

# 01. Import Libraries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

# 02. Import Dataframes

In [3]:
#path=pathway to project folder 
path= r'/Users/alexmendrin/Documents/Career Foundry/Data Immersion/Achievement 4/InstaCart Basket Analysis'

In [7]:
#import most recent products dataframe
df_prods= pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col=False)

In [8]:
#import orders_combined
orders_combined= pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_combined.pkl'))

# 03. Check Dimensions of Dataframes

In [9]:
orders_combined.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [18]:
#drop previous _merge column
orders_combined= orders_combined.drop(columns= ['_merge'])

In [19]:
orders_combined.shape

(32434489, 10)

In [11]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [13]:
#drop unnamed columns
df_prods= df_prods.drop(columns= ['Unnamed: 0'])

In [14]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [15]:
df_prods.shape

(49672, 5)

# 04. Merge df_prods with orders_combined

In [20]:
#inner merge of datasets
df_merged_complete= orders_combined.merge(df_prods, on= 'product_id', indicator=True)

In [21]:
df_merged_complete.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

In [23]:
#check value counts
df_merged_complete['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [24]:
#check full merge rate
df_merged_outer= orders_combined.merge(df_prods, on='product_id', how='outer', indicator=True)

In [25]:
df_merged_outer['_merge'].value_counts()

both          32404859
left_only        30200
right_only          11
Name: _merge, dtype: int64

#### There is not a complete merge of the two data sets, as there are values of left and right_only

In [26]:
df_merged_complete.shape

(32404859, 15)

# 05. Export merged dataframe

In [27]:
df_merged_complete.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))